Repository: artemnovichkov/horoscope
Catalog: Packages/MainFeature/Sources/MainFeature/Resources/Localizable.xcstrings
Source language: en
Languages: ru

# appleIntelligenceNotEnabled
source: Apple Intelligence is not enabled. Please enable it in Settings.
ru: Apple Intelligence недоступна. Пожалуйста, включите её в Настройках.

# deviceNotEligible
source: This device is not eligible for Apple Intelligence. Please use a compatible device.
ru: Устройство несовместимо с Apple Intelligence. Воспользуйтесь устройством, которое это подерживает

source: for developers
ru: для разработчиков

source: Generate
ru: Сгенерировать

source: Generating horoscope…
ru: Генерируем гороскоп…

source: Github username
ru: Имя пользователя Github

source: Horoscope
ru: Гороскоп

# modelNotReady
source: The language model is not ready yet. Please try again later.
ru: Языковая модель недоступна. попробуйте позже.

source: Settings
ru: Настройки

# shareTipMessage
source: Share your horoscope with your friends
ru: Поделитесь гороскопом со своими друзьями

# sharingTipTitle
source: Sharing
ru: Поделиться

source: Transcript
ru: Транскрипт

# unknownReason
source: The language model is unavailable for an unknown reason.
ru: Языковая модель недоступна.

# usernameTipMessage
source: Enter your Github username and tap Generate
ru: Введите имя пользователя Github и нажмите Сгенерировать

# usernameTipTitle
source: Username
ru: Имя пользователя
